import { Template } from "../containers";
import { HorizCard } from "../components";
import post from "../assets/post.jpeg";
import subsidy from "../assets/subsidy.jpeg";
import reforestation from "../assets/reforestation.jpeg";
import road from "../assets/road-construct.jpeg";
import checkdam from "../assets/checkdam-construct.jpeg";
const Events = () => {
  const cards = [
    {
      image: post,
      title: "การติดตั้งป้ายโครงการ",
      content:
        "นายชุมพร เวชสถล หัวหน้าโครงการพัฒนาป่าไม้ตามแนวพระราชดำริบ้านซับตะเคียน ได้เดินทางไปยังเขาซับตะเคียนเพื่อตรวจสอบความถูกต้องในการติดตั้งป้ายบอกทางของโครงการจำนวนสามบริเวณ",
      date: "14 ต.ค. 2565 -  10 พ.ย. 2565",
    },
    {
      image: subsidy,
      title: "มอบเงินสนับสนุน ณ ที่ทำการผู้ใหญ่บ้าน",
      content:
        "นายชุมพร เวชสถล หัวหน้าโครงการพัฒนาป่าไม้ตามแนวพระราชดำริบ้านซับตะเคียน ได้นำเงินสนับสนุนมูลค่า 50,000 บาทไปมอบให้แก่หมู่บ้านป่านิเวศ จังหวัดเพชรบูรณ์",
      date: "9 ก.ย. 2565",
    },
    {
      image: reforestation,
      title: "โครงการปลูกป่าเนื่องในวันอาสาฬหบูขา",
      content:
        "นายชุมพร เวชสถล หัวหน้าโครงการพัฒนาป่าไม้ตามแนวพระราชดำริบ้านซับตะเคียน ได้จัดกิจกรรมปลูกป่าเนื่องในวันอาสาฬหบูชา ประจำปี 2565 ณ หมู่ 9 ตำบลสระแก้ว จังหวัดเพชรบูรณ์",
      date: "23 ก.ค. 2565",
    },
    {
      image: road,
      title: "การก่อสร้างทางเดินรถเข้าโครงการ",
      content:
        "นายชุมพร เวชสถล หัวหน้าโครงการพัฒนาป่าไม้ตามแนวพระราชดำริบ้านซับตะเคียน ได้เดินทางไปตรวจสอบความเรียบร้อยในการก่อสร้างทางเดินรถหน้าโครงการ โดยเป็นการพัฒนาจากถนนลูกรังสู่ถนนลาดยาง",
      date: "10 ธ.ค. 2564 - 18 ธ.ค. 2564",
    },
    {
      image: checkdam,
      title: "การก่อสร้างฝ่ายชะลอน้ำ",
      content:
        "นายชุมพร เวชสถล หัวหน้าโครงการพัฒนาป่าไม้ตามแนวพระราชดำริบ้านซับตะเคียน พร้อมเจ้าหน้าที่ที่เกี่ยวข้อง รวบรวมชาวบ้านหมู่ที่ 9 อำเภอสระแก้ว จังหวัดเพชรบูรณ์เพื่อร่วมแรงกันช่วยก่อสร้างฝ่ายชะลอน้ำตลอดลำห้วยเพื่อกักเก็บน้ำและลดการพังทลายของหน้าดิน",
      date: "15 พ.ค. 2564",
    },
  ];
  return (
    <div>
      <Template heading="ภาพกิจกรรม" body={<HorizCard cards={cards} />} />
    </div>
  );
};

export default Events;
