import { Blog, Template } from "../containers";
import king from "../assets/king.jpg";
const History = () => {
  const texts = [
    "ด้วยความห่วงใยในทุกข์สุขของอาณาประชาราษฎร์ นับแต่ที่พระบาทสมเด็จพระเจ้าอยู่หัวเด็จเถลิงถวัลยสิริราชสมบัติเป็นต้นมา พระองค์ได้เสด็จพระราชดำเนินไปเยี่ยมเยียนประชาชนตามพื้นที่ต่างๆ ทั่วประเทศ โดยเฉพาะในพื้นที่ชนบทยากจน อยู่ในภูมิภาคต่างๆ มากกว่าประทับอยู่ในพระราชวังที่กรุงเทพฯ ทั้งนี้เพื่อทรงค้นหาข้อมูลที่แท้จริงจากประชาชน เจ้าหน้าที่ของรัฐประจำพื้นที่ และทรงสังเกตการณ์ สำรวจสภาพทางภูมิศาสตร์ไปพร้อมๆกันด้วย ทั้งนี้เพื่อทรงรวบรวมข้อมูลไว้เป็นแนวทางที่จะพระราชทานพระราชดำริในการดำเนินงานโครงการอันเนื่องมาจากพระราชดำริต่อไป",
    "พระราชดำริเริ่มแรกอันเป็นโครงการช่วยเหลือประชาชนเริ่มขึ้นตั้งแต่ปี พ.ศ. 2494 ทรงพระกรุณาโปรดเกล้าโปรดกระหม่อมให้กรมประมงนำพันธุ์ปลาหมอเทศจากปีนัง ซึ่งได้รับจากผู้เชี่ยวชาญด้านการประมงขององค์การอาหารและการเกษตรแห่งสหประชาชาติ เข้าไปเลี้ยงในสระน้ำพระที่นั่งอัมพรสถาน และเมื่อวันที่ 7 พฤศจิกายน 2496 ทรงพระกรุณาโปรดเกล้าโปรดกระหม่อม พระราชทานพันธุ์ปลาหมอเทศ นี้แก่กำนัน ผู้ใหญ่บ้านทั่วประเทศ นำไปเลี้ยงเผยแพร่ขยายพันธุ์แก่ราษฎรในหมู่บ้านของตน เพื่อจักได้มีอาหารโปรตีนเพิ่มขึ้น",
    " โครงการพระราชดำริที่นับว่าเป็นโครงการพัฒนาชนบทโครงการแรก เกิดขึ้นในปี พ.ศ. 2495 โดยพระบาทสมเด็จพระเจ้าอยู่หัว ทรงพระกรุณาโปรดเกล้าโปรดกระหม่อม พระราชทานรถบลูโดเซอร์ ให้หน่วยตำรวจตระเวนชายแดนค่ายนเรศวร ไปสร้างถนนเข้าไปยังบ้านห้วยมงคล ตำบลหินเหล็กไฟ (ปัจจุบันคือ ตำบลทับใต้) อำเภอหัวหิน จังหวัดประจวบคิรีขันธ์ เพื่อให้ราษฎรสามารถสัญจรไปมาและนำผลผลิตออกมาจำหน่ายยังชุมชนภายนอกได้สะดวกขึ้น",
    "  จากนั้นในปี พ.ศ. 2496 ได้พระราชทานพระราชดำริให้สร้างอ่างเก็บน้ำเขาเต่า อำเภอหัวหิน จังหวัดประจวบคิรีขันธ์ เพื่อบรรเทาความแห้งแล้ง เดือดร้อนของราษฎรและสร้างเสร็จใช้ประโยชน์ได้ในปี พ.ศ. 2506 นับเป็นโครงการพระราชดำริทางด้านชลประทานแห่งแรกของพระองค์",
  ];
  return (
    <div>
      <Template
        heading="โครงการอันเนื่องมาจากพระราชดำริ"
        body={<Blog image={king} texts={texts} />}
      />
    </div>
  );
};

export default History;
